{
    "title": "Thinking of retiring earlier than planned",
    "author": "Impressive-Scheme894",
    "content": "I am 59 and I had planned on working full time until I was 62. However things have recently changed at work and in life that is leading me to rethink my plan and retire next year. I am a little worried about the finances. If I retire next year I will have a $9k a month pension and health care. I should have approximately $300k in investments and $75k in cash when I retire next year. If I wait to 62 I might get those numbers up by $100k. I have a $225k mortgage at 2.3% interest rate. Total payment with insurance and taxes is approximately $1300 month. Other than that I do not have any other debt. I know I am very fortunate but I guess I just wanted to ask other’s thoughts on my situation. Thanks",
    "score": 29,
    "created_utc": "2025-01-23 00:12:25",
    "comments": [
        {
            "author": "Mid_AM",
            "content": "Hello! Thanks for sharing with us OP, original poster.\n\nFolks, if you want to chime in - make sure you have hit the JOIN button. This rule, along with our other guidelines ( like we are conversational, not confrontational here) can be found on the landing page of this subreddit. \n\nThanks! MAM",
            "score": 1,
            "created_utc": "2025-01-23 20:25:00",
            "depth": 0
        },
        {
            "author": "Th13027",
            "content": "I wouldn’t work another day if I could collect a 9k pension. Time is way more valuable than $$ once your basic needs are met. You should meet them with 9k",
            "score": 1,
            "created_utc": "2025-01-23 22:29:54",
            "depth": 0
        },
        {
            "author": "IShouldaDownVotedYa",
            "content": "What’s this word pension people speak of?",
            "score": 1,
            "created_utc": "2025-01-23 21:39:58",
            "depth": 0
        },
        {
            "author": "GeorgeRetire",
            "content": ">I just wanted to ask other’s thoughts on my situation.\n\n(shrug)\n\nWithout knowing your entire financial situation, your expenses in retirement, your goals, etc., it's hard to make any real analysis.\n\nGood luck.",
            "score": 1,
            "created_utc": "2025-01-23 21:43:50",
            "depth": 0
        },
        {
            "author": "oakstreetgirl",
            "content": "9000 a month with little or no bills will be fine.  More than enough, unless you spend a lot, which doesn’t sound like it being that you have no bills other than a low mortgage payment.  Retire, you really don’t know how much time you have to enjoy life",
            "score": 1,
            "created_utc": "2025-01-24 04:33:17",
            "depth": 0
        },
        {
            "author": "jarbidgejoy",
            "content": "Live on 9k per month for the next year to see if that is enough. If it is then go for it, save the investments and cash for later in life healthcare and emergencies.",
            "score": 1,
            "created_utc": "2025-01-23 22:50:27",
            "depth": 0
        },
        {
            "author": "fgransee",
            "content": "$9,000 a month equals about $2.7M at a save withdrawal rate over 30 years - just you have the pension for life. If this meets your budget, you are golden. What is your monthly budget",
            "score": 1,
            "created_utc": "2025-01-24 01:52:57",
            "depth": 0
        },
        {
            "author": "PersianofInterest",
            "content": "First off, congratulations on being that financially healthy. You should be proud. The one thing that jumps out to me is what a couple of other folks as have said. Build a monthly budget. By budget I mean every expense you can reasonably anticipate or think of, and be honest about all expenses. Then, deduct that monthly expenses number from your pension. While I’m not an expert, your top line numbers (income) looks healthy, even in relatively expensive area, and you should be able to manage well in retirement with that.",
            "score": 1,
            "created_utc": "2025-01-23 21:27:57",
            "depth": 0
        },
        {
            "author": "chouseworth",
            "content": "A 9K per month pension is outstanding, and obviously a good start.  In any case, you will find it well worth it to spend some money and time with a financial planner, and supplement that advice with your own analysis of different scenarios.  Boldin has an excellent set of tools to do this and can be found easily on the web.",
            "score": 1,
            "created_utc": "2025-01-23 22:20:25",
            "depth": 0
        },
        {
            "author": "seebonesell",
            "content": "If you get sick you don’t have a choice. Enjoy every day. Tomorrow is not promised.",
            "score": 1,
            "created_utc": "2025-01-24 01:32:51",
            "depth": 0
        }
    ]
}