{
    "title": "I’m noticing there are 2 kinds of Gen X",
    "op": "My wife is 2 years younger than me but raised by 2 boomers. I was raised by a silent gen mom. My wife has that typical boomer mentality whereas I’m more whatever never mind. She was more parented, having both parents growing up where I was the more feral latchkey kid. Is this a thing?",
    "comments": [
        "We're not really monotone,  in the USA there's more than a couple kinds of Gen X.",
        "I was a latchkey kid of boomers who were somehow simultaneously neglectful and controlling.",
        "I was raised feral by Boomers.",
        "Both my parents were born before WW2 (and I mean 1939) and they were very, very much Silent Gen.  Their parents were severely affected by the depression and so of course, my parents were too.\n\nMy two Z daughters are way more like Silent/X and not at all Boomer/Mill.  They're super frugal, pessimistic, question everything...but they are incredibly progressive.  Imagine taking the pragmatic values of the Silent Generation and weeding out the racism, homophobia, etc.  Honestly, the Z'ers give me hope for the future of people...",
        "I was born in 1979 to two boomer parents, total latchkey kid. I wasn't parented for shit. I remember asking my parents if they saved any money up for me for college and I got laughed at. I am an only child. Like how did you screw that up.",
        "There are much more than only 2 kinds of Gen X lol. We are all from different backgrounds and experiences in life.",
        "Raised by my grandparents - both born in 1916.  They were 50 the year I was born.\n\nThey were great.  I knew they cared about me, but they didn't smother me - let me figure out a lot of things on my own.\n\nFor example, when I was 16 I totaled the car they bought me.  They made sure I was OK, didn't give me a hard time, and made sure I got back behind the wheel quickly, but without being pushy about it.  They instilled a great sense of independence and self-reliance.  I'm not nearly as good of a parent as they were.\n\nI definitely have a \"whatever\" and \"live and let live\" attitude.  Basically, you do you - just don't bother me about it.  I'm still shocked that we went from that to an \"everybody has to think the same thing\" hive-mindset. WTF????",
        "Usually boomers were born after WW2, so anybody born in the first tranche of Gen X had really young boomer parents (probably struggled financially) or older silent gen parents (more traditional, conservative and well off) and had childhoods in the 70s\n\nMost Gen X i know have middle aged boomer parents (lived their adult lives through the 70s stagflation) and lived their childhoods in the 80s. Definitely large difference between the two experiences.",
        "My parents were Silent Gen and my Siblings are Boomers. I am the youngest, much youngest with a decent gap between me the next one. So much so I was raised like an only child. I am definitely more on the typical whatever side.",
        "Immigrant GenX here, I read this sub and feel super disconnected from you guys most of the time. There are a few posts I connect to but they are super few and really far between.",
        "My husband and I are exact opposite. We’re only 2 months apart but my parents were boomers and his were silent Gen. he was treated as a precious grandchild, wasn’t made to do chores, etc. my parents were like, can you reach the lawnmower handle yet??",
        "I had Boomer parents and I have never thought like a Boomer in my life. I’m 100% GenX born in ‘75.",
        "[deleted]",
        "I have a mixed bag so to speak.  My dad is silent gen and my mom is a boomer.  \n\nDad was low key, but meant business when he was mad.  He didn't talk a lot that can remember growing up, so when he spoke, you listened. \n\nMy mom does all the talking, non stop.  She made up for dad's lack of talking.  \n\nSo I am a quiet and a chatty Cathy at the same time?!?",
        "Yes, two kinds: XX and XY",
        "Generalizations of generations is a fool's errand.",
        "I was born in 70 and raised by a single mom. She was born in 49 so I guess Boomer. I was a latchkey kid and very feral. I am very open and accepting of people. I’m a Metalhead girl that still goes in the pit. Sometimes feel more like a Millennial. I don’t even know what Gen I belong in. It’s hard to fit in anywhere.",
        "Douglas Coupland in \"Gen X\", originally divided the generation into three groups. The first walked into the shit storm thinking they'd have the same lives as their boomer parents, the second watched their older siblings fail and settled in for the long haul at Mum and Dad's house. He called them Global Youth (I think). I forget the third group, tried to over achieve I think.",
        "I don't know what kind I am.  Product of 2 teen hippies, but raised my grandparents off and on.  Raised by southern baptists (grandparents) and a variety of religions based on who my mom was dating that year. Family tv in the living room only had religious shows on, but my grandpa would be in the bedroom watching Benny Hill, Monty Pythons, and HeeHaw.  So my sister and I sat with him and watched TV on a 7 in b/w camping tv.",
        "Guess which kind I am by my username.  (Mom was Silent Gen)",
        "My dad was Silent Generation (1939) and mom was early Boomer (1947); their parenting styles were very different. My dad was very much the hands-off, let-me-figure-out-things-for-myself type, while my mom was a bit more hands-on, almost to a fault.",
        "Dad was born in 29 mom in 34  , once in a while they would talk about their childhood 😳😳😳 latch key? Was nothing compared to what I heard I tell ya. So leaving us alone was not a big deal at all for them . For instance… dad was from England and his country was bombed every night , you just got used to it he would say as his school and buddy’s house was blown up. Mom was from the east coast Canada and tell tails of the Mounties busting down the door looking for moonshine her father made , freaking out the 11 kids living in two bedrooms.So ya I had to open up a can of chef boy ardee ravioli on occasion",
        "Gen Xer born in '72 to a Boomer parent. She was a single parent so I was a latchkey kid. I had to deal with a lot of my mother's drama so I was a small adult as a child. I was left to myself a lot as my mother was working and caught up in her own mess. I spent a lot of time taking care of her instead of the other way around. I am definitely the whatever, live and let live type of Gen Xer. I am very independent and self reliant as well.",
        "My older sister & I are three years apart, raised by Silents, both of us latchkeys, both born in the 60s. \n\nShe’s definitely more Boomer than I… which makes me suspect there’s more to consider; like sibling placement.  Wasn’t that the foundation of the Growing Pains sitcom?\n\nNot to disagree with the OP’s - just saying there’s likely many factors and no simple answer.",
        "Everyone is unique. Generations are walls of fog.",
        "Born in 75. Feral latchkey, raised by boomers who have luckily evolved into less boomer thinking over the years. I have one younger sister and we lived in the middle of nowhere, so it was like being five to ten years behind bigger cities anyway. It felt like the 80’s lasted for about 15 years there. I also spent a lot of time around my silent generation grandparents, so that definitely made me a different kid than many of my peers. \nI have twins who are currently 9, so that makes me a generation ahead of their friends’ parents…which is sometimes weird. Hell, I’m older enough to be a parent to some of their teachers in school. The gen-x definitely shows in the way these kids are raised.",
        "I am thinking that people are more individuals rather than tied to any select group all the time. jmo.",
        "My dad was born in 45 (silent gen) and my mom was born in 46 I think (boomer). They both had characteristics of each, particularly being thrifty and completely hands off unless it involved punishment, abuse, or guilt-ridden attention after dad went on a bender.",
        "Two boomer parents here who were more interested in screwing up each others' lives than raising us kids. We are \"Whatever\" Gen X latchkey kids, who in some ways had to raise our own freakin' parents.\n\nMy friend, age 49, was raised by SilGen parents and he is a total boomer. In fact, his boomer ways are currently threatening our friendship.",
        "I was a feral, latchkey kid raised by two extreme Boomers. My mom worked nights and I saw her almost never.",
        "My mom is a boomer and “raised” us by herself(and whatever man of the month she brought home). I was very much a latchkey kid, and as the oldest female child, the default parent to my younger siblings, step-siblings, and half siblings as they would come and go. Everyone I know with silent gen parents were raised with older fashioned values with both parents in the house, dad worked mom raised the kids. My mom was out doing all the LSD, coke, and men she could find. She’s still a hippy.",
        "Not sure the correlation you’re going for. My boomer parents raised me into a live-and let-live, IDGAF adult.",
        "It's almost as if people are different lol",
        "Born in 1964, I grew up with two Silent Gen parents. Never had a latchkey experience. So they might be correlated.",
        "Nah both my parents were boomers, and a selfish, unaware pair of nonparents. I was a latchkey kid, totally feral. My mother didn’t even notice I could read at age 3 and a half until my grandmother pointed it out to her.  \n\nParents divorced when I was still pretty little, and I only saw my dad for every other holiday and two weeks at the beginning then two weeks at the end of summer. And he worked whole time I was there in the summer. I just recently realized that the neighbors probably weren’t aware that my sibling, step-siblings and I spent most of our days in their pool while they were at work.",
        "My husband was raised by Silents, I was raised by Boomers.\n\nI think I'd need to understand what OP meant by \"typical Boomer mindset\" I guess. I can tell you that my husband and I are very similar in our political ideology and general philosophy on life. He tends to be a little more laid back about things, whereas I have a much more methodical approach to life. It works for us. \n\nWe appreciate the advantages we've attained in our lives. We understand that while we have worked hard there is no doubt that we have had some really lucky breaks that made all of it possible. It didn't have to be this way, we know it and are grateful that we've got what we have. Not sure where that places it in your spectrum but honestly- wtf, X is X for a reason- we don't fit into molds easily.",
        "My parents were boomers. Boomer parents kicked off the divorced kids generation, leading to latch key kids and all that… aka us.",
        "Some of us are just a little bit different and watched it all as we still do. Will place the comma when necessary.",
        "My mom was a boomer (Dad, too, but didn't live with him), I was a latchkey kid. I'm pretty whatever.\n\nI think it's situational.",
        "Yes.  My husband is born in 65 and I was born in 70.  He was much more latchkey than me but I did have a taste of it once my older sisters moved out and I became an only child from age 10 on.",
        "My parents were old enough to remember hearing about Pearl Harbor on the radio so Silent Generation. \n\nI was pretty feral but it wasn’t neglect. They grew up in the country. Worked as kids and never thought twice about wandering off to fish (mom loved fishing dad hated it) or off to shoot marbles or whatever so it was normal to them to wander about.",
        "I will say this:  most GenX weren't as coddled as children like Millennials/GenZ were.  I think this translates into greater independence and free spirit.  Can't tell you how many Millennials I know that still live with their parents.  Me and my sibling were outta there at 18...",
        "I do t think so tbh. There are a LOT of variables. If anything, I always understood the \"latchkey\" Gen X thing to be about the kids of (middle class) Boomers whose mothers started working in the 70s, often because the father left them. Or because they wanted more money, or because now they could more easily without social sanction. The middle class kids of Silent Gen tended to have stay-at-home moms. \n\nThis is also totally about class. My Boomer's mother's mother was a very poor single mom to 3 kids in the 50s. My mom and her sibs were definitely latchkey- my grandma worked 2 jobs and was never home. They raised themselves. \n\nMy SO though, raised by older parents than me, was raised by a sahm, that was the norm for his mom's generation.\n\nAlso, \"Boomer\" is a huge generation. The ones born in 1947 are not at all like the ones born in 1960!\n\nETA a lot later for clarity sigh.",
        "[deleted]",
        "Also depends what end of gen x you are . There is the 65-72 and then 73-80. Early gen x went to high school in the mid to late ‘80’s and late gen x (men went to high school in the early 90’s that high school divide is kind of huge. 80,s were hair bands and 80’pop while 90’s was grunge and hip hop. 2 very different versions of gen x. I have a neighbor who is early and I am late and we are not the same.",
        "Latchkey X FTW.",
        "Boomers are more likely to have produced feral latchkey kids",
        "I had both parents growing up, as did my wife, but I can see the difference. \n\nThree stories of my \"feral\" upbringing - as all Gen-X people, remember: no internet, no cell phones etc. etc.   \n  \nI'm in 7th Grade, my brother is in 4th grade. It's Friday. I get home from school in the afternoon. House is locked & dark.  Let myself in. There's a $20 bill taped to the refrigerator, with a note,  *\"Went away for the weekend! See you Sunday night! Love Mom & Dad\"*  THIS HAPPENED OFTEN.   \n  \nI went on a 900-mile bike trip when I was 14, took 9 days to get to my destination. Called home once mid-trip, mom said, \"Sounds like you're having fun! Call us when you get there!\" and that was about it. When I called from my destination, nobody was home so I left a message saying I would be staying at this youth hostel and would take a train home next week, so please pick me up at the station (they did). \n\nAs a high school graduation gift,  my parents gave me a one-way plane ticket to Europe, a Eurail pass, and I had  cash gifts from my grandparents, aunts and uncles - which worked out to $1,500 (equivalent of about $4,800 today). At the airport, they told me \"Let us know when you're coming back, we'll pick you up!\"   \nI had to make sure I would have enough money to buy a ticket to fly home from wherever I ended up - so about $1,000. There were no cheap airfares then. 6 Weeks later, money was running low, so I went to a TRAVEL AGENT to buy a ticket, and then I made my one and only call home (it was EXPENSIVE) to let them know where and when to get me. \n\nLots of fellow gen-x people I know have similar stories. \n\nMy Gen-X wife didn't do a solo trip of any kind until she was 19; all of her trips were family trips, with mom and dad handling all the logistics. She didn't lead a sheltered life, but she definitely didn't have the kinds of \"unbounded\" experiences I did. \n\nOf course, I understand now that I have two daughters *why* you might not want to put your 14 year old on a plane to far-far-away by herself with no particular plans for a return trip (but we did exactly that anyway with one of my daughters), and I do think that my \"feral\" upbringing, gave me both the gift and penalty of being very independent from my family and wanting to tackle big problems on my own, without asking for help. \n\nThis is well balanced by my wife's far better level of connection and communication with her immediate and extended family. I have an uncle who lives about 2 hours away from me. I have not seen him in person in over 20 years. My wife's family has large gatherings at least 2 times a year. I know more about her cousins than I do about my immediate family. So, all in all, it works out.",
        "Most get x was from divorced single parents which made us feral children and adults!! Wdgaf!  FAFO!",
        "I think it absolutely is a thing \n\nI went to a marketing seminar a while back and they were talking about the difference between GenZ and Millennials- there were a lot of specifics but they attributed much of it to GenX raising GenZ with Bommers raising Millennials \n\nThey said GenZ has values more like the silent gen because that’s who raised us (GenX)\n\nI’ve always found this to be true when speaking broadly \n\nWho raises you matters a lot",
        "The generations are just societies generalizations of a population as a whole.   My wife and I are mid to late X.   We have far more in common with early millennials than early X ers as we are only a few years ahead of them.   \n\nSo.   It’s fair to assume Xers have this as well.     We are just grouped as we are because we are  the dip in the birth cycle….",
        "My parents were Boomers and I’m all yeah, whatever, nevermind",
        "My parents are silent gen and were quite a bit different than my friends boomer parents. Boomers were more wild and party animal types. They're mostly dead now and my parents are still alive",
        "**My older brother is 1968 and I’m 1973** …. He is a cookie cut version of my Boomer parents.  Very much a Mama’s Boy and “gotta be just like Daddy and make him proud” ….. I love my parents and am grateful but hot God, I just don’t give a shit about 90% of what he gets uptight and intense about.  I’m very much the outspoken rebel who doesn’t mind rocking the boat whereas he will NEVER rock any boat.  \n\nIt’s astounding that we are both technically GenX, raised by the same parents, and yet **we are more different than night and day.**",
        "\"We got both kinds, we got country AND western.\"",
        "My brother and I were born in the late seventies. Parents were Boomers. We were not “latchkey kids” who ran feral in the streets. We were looked after and well cared for (“parented” in other words). Honestly I struggle to relate when I come to this subreddit. I don’t feel like I have the same attitude or shared experiences as most of you do. The whole concept of generations is so strange to me anyway. It should be the decade that you were born in that defines your generation. I find it very difficult to relate to someone who was already in junior high school by the time I was born. Also I absolutely HATE the word “whatever!!!” I know I’m probably the only one here who feels this way, but I just wanted to share my thoughts. FWIW.",
        "I was raised by silent generation parents. They were not complainers and believed in suffering in silence. Pretty much suck it up and deal with it mentally. I’d say Gen X raised by Silent Gen are the whatever part of Gen X…for the most part.",
        "I think there are many kinds of GenX people, without even going global. I find the GenX stereotypes rather tiresome and haven’t really met any like that in real life.",
        "Born in June 1978 (only child) to parents who were technically Silent Gen, but dad (December ‘44) was much more of that generation while mom (April ‘45) is a caricature of a self-centered, childish boomer. She’s also extremely mentally ill (BPD with paranoia and narc features) and had me after being married for 9 years and alienating all other family and friends. In true Silent fashion, my dad escaped into work and left me with her, shrugging me off whenever I tried to tell him what was going on at home. I’ve been no contact for almost ten years now, not without multiple attempts to rope me back in and take the heat off Dad.",
        "I’m a late gen-xer/xennial. I have a friend who’s only 3 years older than me, but she absolutely behaves like an old lady. Watches little house reruns, etc. I haven’t watched little house since I was a kid, lol. I think there was a conscious rejection of previous generations’ cultures in my peer group.",
        "My dad is silent Gen my mom is a boomer and oh my god am I a fucking mess lol",
        "I think it is some kind of thing.  I was raised by two Silent Generation parents.  I honestly cannot fathom the Boomer mindset at times.  Sometimes, my confusion extends to younger GenX'ers, who would probably have been raised by Boomers.",
        "Gen X types are plentiful, I think. It’s like the alternative sections you used to see at record stores (remember those!!!???). There’s all sorts of shit in there.",
        "I'm at the (young) tail end of GenX. \n\nRaised by boomers but my Mom was really ahead of her time, still is. \n\nParents went through an ugly divorce, then partially raised by my Greatest Gen grandparents. \n\nI don't feel like I relate to anyone. Definitely no fucks given about most things unless they intrude upon me and mine. \n\nLive rural and have acreage but also live in an unfortunately developing area. I am ready to move extremely rural. Not see neighbors. Not be bothered. \n\nI've felt like this was since I was about 25. At 47 peace and isolation have gone from a want to a need. The ultimate \"eh\". Screw society.",
        "I had 2 Silent Gen parents and was a product of what one might call \"benign neglect.\" They did see that I was fed, clothed, and educated. I think Boomers were more involved parents on average, but it no doubt varies from individual to individual.",
        "I have boomer parents and I'm more oh well, whatever, never mind.  I don't think it's as simple.   \n\nWe're a product of our environment, and many Gen-X grew up in largely similar environments: 2 working parents, latch-key kids, free-range, too much access to sugar, too much sun exposure and not enough sunblock, dangerous toys, indifferent to the threat of pedophiles or kidnappers,  ready for quicksand, playing in the street was a skill that was honed, was part of a bicycle gang, has at least one scar from childhood that persist to today, toughed it out when we should've gone to the hospital, and caught at least one thing on fire.",
        "My folks were early boomers, and both of my grandfathers were WWII vets, so my parents are nothing like the later boomers or Joneses and much more like the Silent Gen.  This group has shown me that when you were born really means nothing as far as having things in common with others.  When it come to really getting along with others, it’s more about shared politics and values.",
        "Does anyone wonder what your mom was doing all day in the house after she schooed you outside?\n\nMy mom was a ferocious reader, and napper, but it was ALL DAY.",
        "The early half genx at my workplace are basically boomers to me if I’m being perfectly frank. \n\nGot dudes blasting Whitesnake/White Lion/Great White and aren’t joking. Seen a dude in a flame print button up shirt eating chili with the bad shades perched on his ugly hat. You know what I’m talking about. Just hurtin’ steez that blows my mind sometimes. Also that same specimen will use the same movie one-liners like Arnie’s  “I’ll be back” without a hint of self awareness about how unfunny and repetitive it gets. \n\nBorn 74 so I’m still a brutally judgmental snob.",
        "This is The Way.",
        "I have a boomer parent and was left to myself for almost my entire childhood.  I could have a disappeared for a month and my mother wouldn't have noticed. Born 1972.",
        "You also have the GenX that are way more like millennials.... My guess is they're the majority here on this sub.",
        "There is a generational gap between Gen X and younger siblings as well. My millennial sister and I have very different values based on how/when we were raised, even though we were raised by the same woman. I'm 1970, she's 1985. I am an independent, take care of myself and my own Gen X and my sister is a whiny, entitled, spoiled millennial. I was latchkey. She was daycare. I made my own meals. She was catered to. I was running the streets as a teenager. She was driven to practice and home. We are not the same.",
        "No this just shows the Gen X stereotype doesn't always apply. Just like 90's music is misleading. For every Nirvana there was a Salt N Pepa and Hanson. Angsy Gen Xers have filtered out a lot of the reality of the generation. There's a reason some of us felt like outsiders: most weren't full of angst. They were trying to get jobs at Fortune 500 companies. It's just like Boomers. The \"hippie generation.\" Except the majority were never hippies. Donald Trump is a Boomer. You think he was ever doing acid and wering tie dye at Dead shows?",
        "Yes.. I have hardly any experience with this latchkey thing you all talk about",
        "My parents were Silent Generation, but my mom worked. It was unusual in my town. I was a total latchkey kid. My husband's parents were Boomers, divorced by the time he was three, and he was also a feral, latchkey kid. He is actually 5 years older than I am. We were both barely raised by our parents. My mom certainly cared, but when everyone around you is wild, you just lie as well.",
        "I don't think it has anything to do with what generation the parents are from and more to do with how involved they were. My parents were boomers and absolutely wanted nothing to do with me or anything I was interested in.",
        "Feral latchkey here — dad is definitely Silent Gen and mom was from the first year of Baby Boomers. They split up and I lived with dad.",
        "There are Boomers that are more like Silents too. My father is first year Boomer, but was the kid that hung around with his older siblings Greaser gang, like a mascot. His attitudes, how he lived in the 60s and 70s as one of the Straights. So he expected us to be tough, work hard, able to take care of ourselves or each other, expected us to stand up and win any fights at school, etc. My wife's parents are straight up Silents even though she's younger than me. We both were kind of wild in our teens, got in lots of really dangerous situations. \n\nMy cousins though from my younger aunts and uncles, raised by hippie Boomer parents. Very coddled, given everything they wanted, hovered over, total slaves to trends and fads too. I think they look at us as being the scary cousins.",
        "I had silent generation parents and I wasn't parented at all, but my sister is 9.5 years younger than me and was definitely more parented",
        "Yes. My wife is a very different Gen Xer than I am. Not quite a boomer but definitely not a ‘whatever’ Gen Xer like me. She was a feral child like most of us but she was borderline upper class so her experience was very different from mine. It’s not wrong vs right, but it’s just different upbringing.",
        "My folks are boomers and occasionally when money was tight Mom had a job but she tried as much as possible to be there when we got home from school. She really loves being a mom and always showed she cared. I got lucky in the mom department",
        "My ex husband and I are the exact same age, first year X. His parents were Silent Generation, mine were both first year Boomers. Our situation was the reverse of yours. My sis and I were the latchkey kids, he was under contant supervision of his parents, a grandmother, and a nanny.",
        "Hard to say. My wife was brought up by late Silent Gen parents in a stable household, whereas I was brought up by a divorced Boomer mother whose attention was focused mostly on keeping us fed and housed while also needing to raise my severely disabled younger sibling. I feel like my self-sufficient, isolated mentality is as much or more about the particular circumstances of my family than about my generation. Whatever the case, my wife’s Gen X way of being isn’t really the same as mine.",
        "One boomer and one silent generation. Total feral Gen Z here. I wasn’t abused or neglected in the traditional sense of the word. I had good food, good shelter and good schooling. Everything else was me raising myself after about age 10 or 12. Zero parental over sight from about that age. Going to the lake house for weeks on end in the summer alone by age 14. Every other kid I knew was exactly the same so it never felt odd or unusual. Only looking back, now having kids of my own, do I think it was a pretty serious lack of parenting going on. My overall personality is do not give a shit and leave me alone I don’t want to hear your whining.",
        "Latch key kid. Raised myself.",
        "My dad was one year shy of 18 when the WWII ended.  So he was affected by the depression, the war years, plus he was wounded Korea.  I think these experiences were evident in raising me and my older siblings.",
        "Had both parents but they worked so I pretty much raised my little brother and myself. We did whatever no one asked questions. Heard mom say once that she regretted not being around more. They weren’t abusive just mostly absent. We all get along awesome.",
        "My husband is a feral GenX raised by silent generation parents . I was a latchkey kid with divorced boomer parents, but mom was always home at five. \nWe are different, but in a good way.",
        "Gen X (or any generation) isn't a monolith.",
        "Feral latchkey kid born in '74 with Boomer parents from large poor families circa '46 and '51.",
        "I do not identify with much of the latchkey aspects of Gen X.  I grew up with a Silent father and a Boomer mom.   Both of them worked with kids who did not fare well with the neglected parenting of the 60s to the 80s.  As a result, I think they over corrected a bit (which caused its own problems for me as I navigated adolescence.)",
        "Meh, we’re all still feral. I’m the oldest GenX and my coworker is the youngest. My wife is near the middle. \n\nWe’d all let it scab over rather than put a bandaid on it.",
        "born to a boomer and a silent gen. i grew up feral.",
        "I was born in 75 and experienced the 80s as a wide-eyed kid. Super feral. My best friend was born in 1965, and his lived experience from the era was pretty damn different. He's rather Boomer-ish, but he likes our music.",
        "I'm born in 78 and raised by Boomers. Not a Boomer in the least and pretty chill until someone crosses a line.\n\nMy line consist of don't be a dick.",
        "I don't think it's that divisive I do think we're just disheartened when we meet a fellow genX that thinks and acts like a boomer. I have a few friends like that. One of my ex-riends I don't really consider GenX bec she's so much older than me but technically she is... but we might as well be strangers in the night bec she does not get half of the things we talk about.",
        "Kids will identify with their parents or oppose them, whether the parents are silent gen or boomer.",
        "Gen-X born in 72, both my parents were burned out hash head boomers.",
        "My parents were silent gen but very parented but am very of the “whatever” mindset however, I know many Xers that are sadly, very boomer.",
        "Nah my boomer parents divorced and I led a feral life in poverty.",
        "Yeah, but I don't think it's a boomer/silent issue, just a latchkey/correctly parented issue.  I had friends with 2 parents and a clean house and it seemed like magic.\n\n(For the record, I'm a latchkey, not throwing shade at latchkey kids).",
        "I'm older Gen X raised by Silent Gen parents, but feel like I relate more to younger generations because most everyone my age at least where I live act hateful and bigoted like Boomers. I also am interested in exercise and nutrition like younger generations meanwhile my Gen X and Boomer acquaintances look at me crosseyed if I mention anything about trying to maintain health.",
        "'70s kids had a lot more freedom and self-sufficiency than 80s kids. I am a 78-born kid of 1952-born boomers and I would have never been able to ride my bike across town to visit friends. If it wasn't on my street I wasn't going without my parents. I grew up in the era of satanic panic. Fortunately, my parents weren't religious but the culture was kind of terrified in general. The Candyman poisoning thing happened in my town and Halloween was cancelled. They instituted supervised school and mall events like they have now. \n\nHow it's affected the way I raise my kids? I'm happy to say that I would love to raise my children the way my parents raised me although I'm not financially as well off as they were. But the general laid back but attentive mentality was great. It seemed like I hit the jackpot as far as that went. Not neglectful that came before but not helicopter that came after. Also the fact that my dad dodged the Vietnam draft is a big part responsible for my happy childhood, because that also made a difference in the quality of life of 80s raised kids.",
        "My dad is a boomer and my mom is silent Gen. they both didn’t even know they had a kid after I was like 6. They didn’t break up until I was in HS. But their whole relationship was wild and annoying af.",
        "I'm in the same boat. My parents were silent generation and my wife was boomers. She has a more materialistic point of view. I'm more pragmantic. She hates leftovers and I will eat things just not to waste. We've often discussed the differences growing up. \n\nWe do bond over our dislike of milenials. lol",
        "You just described my wife and I perfectly. Like \"Are you me?\" perfectly. It's def a thing.",
        "IDK if it's thing, but my folks were born in '41 and '43 - late silent generation - and I'm definitely of the whatever never mind school of thought.  Didn't go full-on latchkey until 7th grade, though.",
        "Keep in mind both Boomers and Silent Generation raised girls and boys very differently. I'm older than my brothers and I was definitely more parented by my Silent Gen parents. My youngest brother was a latchkey kid. If I had been the last one born, my mother would have stayed home to be sure I was parented properly, taught to cook and sew (yes), and picked out a proper school path for a future mother.",
        "I was raised by boomers, partner by silent gen. I rebelled wholeheartedly against my Christian, republican leaning parents while my partner has parents who both are college graduates and very liberal. We’re both liberal even though my mom said we’d become conservative as we grew older. We’re low 50yo and that hasn’t happened. I could see how your wife could be like that if she gets along with them.",
        "Former hall monitors & snitches are boomer-like",
        "There's as many kinds of Gen X as there are individuals born between the years chosen as representative of that generation.",
        "Agreed I had 2 silent generation parents.  Definitely more feral! We weren't to be seen or heard!",
        "Yes",
        "My mom is a boomer, dad dead and was mostly raised by silent Gen grandfather. Lots of variety. What we have in common was independence as kids.",
        "Definitely is a thing.  My dad's a boomer by age but was raised by his grandparents and so his characteristics are not boomer-ish.  My mom is straight boomer in all of the worst ways.",
        "I had silent Gen parents. Born in 74. I’m not boomery or at least I don’t think so. My sisters born 64 and 67, boomer as hell.",
        "Raised by silent gen parents that got married and had kids late. Don’t fit in anywhere, never really have.",
        "Both my parents were early Boomers, but they divorced when I was very young. I was partially raised by my early Greatest Gen grandma because my ma was busy working and volunteering all the time. My cousins, sister, and I were left to fend for ourselves quite often. My grandma didn't believe in \"coddling\" and if you dared whine about anything, she'd tell you about all the serious shit she lived through. Yeah, there was no competing with that. And to be honest, both my parents dealt with some real hardships as well. So we all grew up to be pretty independent, but also empathetic, compassionate, observant, inquisitive, and accepting (for the most part).\n\nNow, my high school friends who grew up in perfect little homes with two traditional parents and without too much concern for money... they all turned into selfish, know-it-all, judgmental conservatives. They spend their days now whining on FB about things that don't even affect them. They're more Boomer than Boomers.",
        "Both my parents were boomers and I was definitely not parented. I think it really depends on your parents, not just age. My silent gen grandparents were better at parenting me than my boomer parents for sure.",
        "In the UK, my parents are silent gen, husband is same age but his parents are boomers.  We're pretty similar",
        "Remember, WWII and Slient Gen were scared by the fake news of skyrocketing crime, child kidnappings and razors in apples on Halloween.  And they moved on with their lives. \n\nBoomers loudly demanded action and got scared, pulling their kids from playgrounds and voting for \"tough on crime\" laws and politicians. \n\nMore of them embraced being helicopter parents compared to prior generations.  One of the few upsides to social media was seeing Karens and Helicopter Parents for what they are.",
        "I was raised by a Silent Gen and a Greatest Gen. I was surrounded by Greatest Gen growing up.\n\nI really don't relate to the latchkey, raising yourself, divorced parents childhood that so many X had.",
        "I was raised by boomer parents and couldn't give less fucks about most things.\n\n\nI don't think it's as black and white as you're putting it.",
        "Dunno man, my parents are Boomers and I'm definitely more in your camp.",
        "I was a gen x that was raised by a beautiful soul of a mother, and an absolute asshole of a father. My mom didn’t want me to be in the house for fear of my father, and if I was I stayed in my room, as did my siblings.I spent most of my adolescence outside, and away from my home.",
        "Raised by silent generation parents; sister and me were also feral latchkey kids roaming the neighbourhood 🙈",
        "I was raised by Patrick Teahan’s Toxic Single Parent archetype. My dad might have been in the picture if he’d known I existed. My mom pinned me on her husband instead. I didn’t grow up with the husband and have never had any good or bad feelings toward him. I was ecstatic to find out I was not actually the product of a man she chose. Her one night stand turned out to be a great guy.\n\nSo I’m not sure what makes my upbringing. Latchkey kid but child of abuse and neglect. THANK GOD I was GenX and could run feral outside the house and away from her rather than be trapped with her 24/7.\n\nIronically, my young adult kids just yesterday told me how appreciative they were that I tried to give them a GenX-ish childhood and actually let them outside in their own. I quote: “I feel so sorry for kids now. Their parents never let them outside on their own.”",
        "I had a silent gen mother who was a cold authoritarian. Dad was a boomer. I’m very much the epitome of GenX.",
        "I was raised by Silent Gen and found they were more openminded than my friends' Boomer parents.",
        "I was raised by boomers but was very much abandoned and latched key.",
        "I have a whole different take \nMy husband had silent generation parents. I had boomer parents \nHis Married until the end, totally traditional. Mom made breakfast for him every morning, everyone was home for a nice homemade dinner every night. Mom was a scout leader etc \nMy parents divorced, my mom always worked full time. I got myself off to school in the morning and had a pop tart for breakfast. Latchkey kid let myself in after school to an empty house. Lots of lean cuisines for dinner because my mom wasn’t into cooking and was dating. I was totally independent at a young age. If I got sick or forgot something during the school day I was out of luck or had to call a neighbor. Mom was too busy working to volunteer at school.",
        "I agree that it paints a rather incomplete picture to pin too much of a person's mindset on generations. \n\nMy mom was born in '45 but was a swearing, smoking, sci fi reading, unhappy young mother with personality issues who also loved handcrafts like macrame and growing a few houseplants. Paranoid schizophrenia that was poorly treated took her over in her 30s. \n\nI kept the reading and crafts, was feral but solitary and fiercely independent. I could fend for myself early on and took pride in walking to school, the library, to get a haircut at ages 8-11. Heck, at age 4 I was going to a clubhouse to get a soda or to a park or blackberry patch. \n\nThe timeframe made some of those things possible but I would also say that bigger influences were: poverty, being a trailer park kid in Appalachia, lack of health insurance, being an orphan (dead dad) with a single, struggling mom, being a vulnerable target to a family member sexual predator. Also being smart from a family of mixed strains of noncomformity. \n\nI rebelled against GenX itself: I wouldn't wear jeans, didn't smoke or drink or swear, was a determined geek/nerd/bookworm, gave up on makeup early, listened to James Taylor and Carol King rather than Nirvana. Though I did love some REM and Indigo Girls.",
        "Silent parents (‘37 and ‘41) raised us feral. Lol we were all born in the 60s.",
        "I have Boomer parents and I was parented more like Millennials with concerned, involved Boomer parents. So it all depends. Yes, I was a latchkey kid but only for about 30 minutes on each end of the day. And usually in the morning, I called my grandma before I went to school. I have a very close relationship with my mom.",
        "I was a wild child, left to fend for myself and my little brother. I'd stay at my girlfriends house in high-school all the time. My kids  have had us both working from home for years now in their late teens very home body kids, seldom get in trouble and are both hard workers. But as new parents I was 31 wife was 30. My mom was 19 and dad was 22 when I was born.",
        "I don't kmow if there are 2 kinds, but there are definitely different versions. \nMy patents were greatest and silent generations. My sisters (9 & 11 years older) are tall-end Boomers (I call them Boomer X) and then me, solidly Gen X, class of 1990.  All of it influemced me.    \n\nI also notice I am a little more open than some of my fellow GenXers when it comes to how I see other generations and a lot of the world, because my greatest gen dad loved technology and was very ahead of his time when it came to a lot of his views. He also recognized that regardless how much changes, a shit ton stays the same, so I  often view things from that lens.\n\nEdit to add: my Boomer X sisters agree with the \"feral\" comment 😂😂😂",
        "Generation Jones. Love 'em, but they ain't GenX. Hard to be a yuppie and be Genx.",
        "Me and my SO are both GenX, but his folks were Silent Gen and mine were Boomers.\n\nTotally worlds apart when it comes to styles of raising children. SO and his sister had a college fund, food to eat after school, and space in the house to take their friends. \n\nIt sounds like paradise.",
        "Yeah my dads silent gen. And my mum is a boomer. Ironcaily my dad was the strict one and my mum was softer.",
        "I mentioned in another comment that my g'parents brought me up & they were greatest gen. \n\nAs a kid/young teen I seriously thought they only existed to make my life miserable & prevent me from doing everything I wanted. \n\nEgs - dad would insist on driving me everywhere & picking me up (god how grateful would I be for that today!).  However if he didn't think that where I was going was suitable, he'd be back 5 mins later to pick me up. \n\n\"Don't like the look of the place\" was the only answer I'd get when I'd be pleading with him to let me stay at some party. \n\nOf course now I can see that they were just being caring & I am so grateful to them, esp compared to many pals who had younger parents but were not \"monitored\" as closely!",
        "Thank you for mentioning this! My wife pointed out that I'm as Gen X as they come but I don't like smart ass mouths. I don't like the snarky, bitchy negative sense of humor that she says is Gen X. Oh well, like someone mentioned above--we can't paint the generation with one brush. Some of the bristles are different.",
        "Raised by Silent Gen, I totally get it. My sister is a baby boomer, she was our baby sitter... She is sooo upright",
        "I really loved Repo Man",
        "I have silent gen parents. They weren't neglectful, I mean they fed, clothed, etc... us. I'd say we were free range. Let's be honest here, aside from weekends daddy only parented at night. My mum grew up on a farm. Aside from chores she expected us to be outside entertaining ourselves and not bothering the adults. That's how she was raised. Also, there was the possibility that we would be given an extra chore if either parent thought we were bored, so we either stayed outside or made sure to look busy when they were not at work. We are both very much whatever.",
        "Gen X is so big, my siblings I think actually cover the whole thing. Oldest born in 65, youngest in 79, me in the middle. Big difference between them. My oldest raised his kids like we were raised, basically feral (we didn't come home for weeks, sometimes months, from about 15 on, countless trips to the ER, countless times we should have gone to the ER but didn't, got jobs in teens so we could afford to go on dates, buy little things here and there (like booze and drugs) which instead turned into well you can buy your own clothes now and everything else you need, my first car a rusted out Chevy C10 for $300 that I had to use plywood to cover the holes in the floorboards, college, good luck paying for that unless you are really poor or rich but either way our parents weren't getting loans for you even though you don't qualify yourself, etc...) so I enlisted, my bro one year younger worked full time and school part time, in the end we graduated almost at the same time because GI back then sucked and I still had to work almost full time, blah blah.\n\n  \nMy youngest bro; parents were better off when he grew up; inflation in the 80s calmed down, mortgage rates finally below 10%, car loans cheaper, they were making higher salaries, the rest of us older kids were gone and no longer eating up huge bills, etc... so they paid for much of his school, he worked but for living expenses. Even as me and another bro were still finishing at the same time, paying for it all ourselves because \"we were already on our own\".\n\n  \nWhat's funny I spoil my kids, am overprotective, etc... because I don't want them to have to go through what I went through and know how shady it all was. Yet my older bro who also went through the tougher upbringing let his kids run wild just like we did, and if they wanted college it was on them. But my youngest bro who was kind of spoiled is raising his kids like me; spoiling them, they have their own bedrooms, tons of toys, travel sports, have saved 529s for their college, my youngest bro does this because he thinks that is the way it should be just like he got it from our older parents  \n\nNo rhyme or reason to it all. I think our parents were very different parents from their early twenties and much later with all us kids, and us GenX kids are very different.",
        "Millennials are often called echo boomers. Boomer parents are who came up with all that “everyone gets a trophy” thing yet ironically bitch about it the most. Like, this was all your creation.",
        "Wow, so there's only two types of GenX now? I'm kind of surprised that this is a thing? And you base this solely on you and your wife?",
        "Both my parents were midwestern born/raised silent Gen. I was def a latchkey kid. I used to walk 1.5 midwestern blocks from ✨1st grade✨to go home to an empty house at lunch and make myself lunch, (typically grilled cheese and tomato soup). 6 years old. Youngest of 5. I was definitely taught very early to be self sufficient. Now imagine YOUR six y/o doing the same. 😮 I swear my parents were both a bit crazy. 😂 I did not burn the house down.",
        "My mom was silent Gen and my wife’s is boomer.  We were both latchkey kids.",
        "My husband is 5.5 years younger, his boomer age parents are still married, he was definitely more parented in a way more loving home than mine. My parents are the divorced boomer-age, hands off parents, I was a latchkey kid. My husband is more conservative than I am but I don’t think he or his parents really have a boomer mindset. His mom was a 100% republican voter until 2016. I love that she really listens and has ceased her blind acceptance of republicanism.",
        "I'm a late GenX raised by end of the line Silent Gens.\n\nThey didn't act like Boomers at all at the time\n\nTo me, early GenX are Bill Burr types who are obsessed with 70s rock and 80s metal.\n\nLate GenX however are the Pac-Man, arcade, Arari 2600 babies who  grew up fighting the great Sega vs Nintendo wars.\nOptimus Prime is our leader",
        "I consider myself xennial (75) raised by boomers, millennial siblings.  My (72) hubby was raised by silent generation.  So were my Gen x friends who are 10yrs older than me. There is a difference.",
        "I had Silent Gen parents and they did a great job as parents!",
        "Feral gen x here. Hate being indoors and can’t wait for the boomers to depart this world. Also married another feral gen x. It was a fun ride.",
        "Eh. I was raised by a Boomer mom (old Boomer) and an early Gen X stepdad. I'm amongst the youngest of the X. \n\nMy parents were really strict, and even though they both worked and were never home, I wasn't allowed to be feral. They had to know where I was all the time, and I had to call them at work if I was going somewhere new and get permission. I wasn't allowed to drive until I moved out at 17. \n\nI'm a weird mix of wound tight AF and apathetic. I don't care about many things, but if I do care, I'm all in. \n\nMy kid is Gen Alpha, and he's already a tiny advocate for changing everything that's wrong in the world. He's honestly who I want to be when I grow up, because he's not jaded, and believes that he can make a difference. I don't ever remember not being jaded.",
        "As a fellow Gen Xer. I think your wife is the exception to the rule. I grew up with two parents silent Gen parent that hated each other. I was a latchkey kid That raised my younger siblings because my parents were hands off.",
        "GenX raised by silents are very different from those raised by boomers.",
        "Gen X offspring ('74) of Silent Gen parents (born during the war) and I don't have a shred of Boomer in me. Parents worked (Mom went back full-time when I started first grade) and brother and I were latchkeys. They were married almost 55 years. They both came from frugal families who seemed quite scarred by the Great Depression: great-aunt grew up on a farm and made a lot of her own clothes, great-grandfather was an itinerant tradesman.",
        "What about those of us with a silent Gen parent and a boomer parent?",
        "Most likely, most of the people I went to school with had parents who were baby boomers, whereas mine were silent generation.   We usually had different ideas and views on the world.",
        "My father was born ‘36 and my mother ‘56. I only lived with them a short time. Grandparents were 1914 ish *she tended to lie about her age and 1880s ish. \n\nI was a latchkey kid with the grandparents. And when I finally moved back with my parents I was 15 and just did whatever the hell I wanted anyway. \n\nI feel like I am pretty laid back and I try to be as positive an influence as possible.",
        "X with boomer parents. Was not raised by them- was raised by silent gen grands. Grew up very rural. This judgement doesn't work forna lot of us...",
        "These generational lines are the new horoscopes. Amusing but of little value.",
        "Hard to say because there are all kinds of the other categories as well. I was raised by a silent gen mom but she was only silent by 2 weeks. If I had been born one second earlier, I would have been a boomer. My dad was also silent gen, but they divorced when I was young and he didn't raise me, he was far away and I visited him. I guess my family skipped boomer.",
        "I have 2 boomer parents but I’m stereotypical X from my meh, all the way down to my DGAF",
        "There is a third too.  Greatest generation raised me. They had me at a late age in life.",
        "Feels like a really odd question. Do you think all people are alike is the question. Simple answer is no.",
        "I think these \"generations\" are a useful construct, but everyone has a different lived experienced.  That said, I do notice some of this with my and my wife who is five years older. Her parents were born during WW2 and came of age in the early 60s, while mine are classic baby boomers, turning 18 during the summer of love.\n\nThere are other differences between my parents and hers, but I think this seemingly small different of eight years was pretty profound and I think it carries over to the next generation.\n\nThat said, I was the latchkey kid.",
        "My parents were Boomers (1946) and I am about as “whatever, never mind” as I could be. Maybe I did something wrong. My wife is far more concerned about literally everything, but she was way more parented than I was.",
        "Silent gen parents, free range kid. Whatever.",
        "I think it more depends on how many siblings you have and so how unruly your home life was",
        "Yeah I have silent generation parents but they waited to have me so all my friends had boomer parents.  They were all latchkey kids while my mom was Suzy homemaker.\n\nI'm super laid back and DNGAF about anything political or celebrity or social trends.",
        "My parents were born in '44 and '46, definitely boomers",
        "Nature vs nurture.",
        "Raised feral by boomers.  Well mom is a boomer.  Dad was crazy.  All I know is my kids were raised better.  And they mostly like me lol.",
        "And I was raised by two boomers and was a feral latch key kid. Everyone is different and while there are broad strokes that unite us we are also individuals formed by more than the years we were born or our parents were born",
        "'68 Xer here. When I was a kid, I had friends with young parents and they always seemed more cool. Their parents listened to pop music, while mine listened to classical or country. Their parents played tennis, while mine worked in the yard for exercise. There was definitely a difference and I was a little jealous, tbh. Having said that, most of my friends had Silent parents, like mine, and they gave us more freedom to be kids.",
        "There’s a lot more than two kinds. Everyone born between 65 and 79 is a genx and we were raised with a lot of different kinds of parents.",
        "I’ve dated millennials that had a GenX mindset Genx’s that had millennial mindsets and even a millennial that had a boomer mindset.\n\nI think it’s less about generations and more about if your parents actually did parenting.",
        "Ha. I think OP and others are putting wayyyyy too much stock into the generational thing. OP’s wife’s parents, and maybe their parents before them, were different than OP’s. No big deal. \n\nNobody is forcing parents to be helicopter parents at any time. If a 35 year-old mother wants to be a latchkey parent with their kid right now- good for them.",
        "Is what a thing? 2 kinds of Gen X, no.  We are not kinds we are people. \n\nIs it a thing that a lot of us grew up with parents who were not all that involved in our lives and lived how we wanted? Yeah, for me as long as I was quiet and caused no trouble I could do what I wanted. \n\nFor example, biking the five miles into town to play video games at the 7-11 being in the store well past midnight. The 7-11 was next to a couple of hotels that rented by the hour and some warehouses. Truckers, drug dealers, and hookers hung out there at all hours. Was offered drugs, sex, and other things, but I was just there to play video games.",
        "You’re 100% on to something. I always see pre 72 X’ere act more like boomers and the 73-74 forward ones possess a more millennial mentality.",
        "Raised by greatest generation grandparents. I was definitely a more feral kid. Super frugal, Healthy distaste/distrust of government and a much more independent/do it yourself attitude from them that's rubbed off on me.",
        "My worthless parents are stereotypical boomers. Luckily I was raised by my awesome 💥Greatest Generation💥 grandparents.",
        "My parents were born in 1926 so Greatest Generation. SAHM, sheltered suburban neighborhood, I never had a key to the house until shortly before I moved out at age 22. I was raised to be kind of useless and helpless. Turned out to be a kickass worker and a basically capable person anyway. I grew up fairly conservative because my mother was. I'm an older X, born in '66, have become much more liberal with age.",
        "Mom was Silent Gen, her first husband (and father of my half-siblings) was Greatest Gen. My dad was also Silent Gen.\n\n\nMy siblings are (at the youngest) 14 years older than me and behave far more like Boomers than I do (I was sort of a latchkey kid. Once I was allowed to go home after school instead of having to stay in day care, I was generally alone for a bit until my middle sibling arrived home.",
        "Born in 77, raised by early boomers, four of them as my parents were divorced and remarried when I was young. I wasn’t neglected nor latchkey. I’m pretty laid back, typical Gen X with a hint of Xennial.",
        "For sure. The boomer GenX are actually the worst as they’re the ones going full MAGA.",
        "Sounds about right.  I was raised by silent generation, latch key independent, parents rather aloof and detached other than to provide order and structure and set expectations.",
        "I think so, we're either Junior Boomers or Old Millennials. I am an Old Millennial but I know plenty of Junior Boomers",
        "[deleted]",
        "You see us as you want to see us - in the simplest terms, in the most convenient definitions. You see us as a brain, an athlete, a basket case, a princess and a criminal.. ",
        "I told someone today that generations aren't monoliths. There isn't a way to paint any of them with a broad brush. The idea of generations, really just refers to our collective cultural experience and doesn't necessary create a unifying personality.",
        "You mean a monolith?",
        "I've said it before. It's exceedingly difficult to draw exact lines across generations.",
        "Yep.  Boomer and Silent Generation patterns. Married until my mother passed. Latchkey after started middle school.",
        "Whatever. s/",
        "…and how many kinds of hot dogs?",
        "I was raised by a Single mom that was the same. Very odd combination.",
        "Im a millennial w boomer parents, and my god do I resonate w that lol.",
        "It was a real skill they had. Neglectful controlling parenting.",
        "Ah the uptight type that also took zero initiative when it counted. That was mine anyways.",
        "I was raised with a baffling combination of hands-off and micromanagement by Silent Gens who were worn out from raising 4 Boomers.",
        "Raised feral by Silent Generation parents born in ‘40 and ‘43.",
        "I was raised feral by Silent Gen.",
        "Same. They were totally absent assholes who should have never procreated, and yet here we are.",
        "Hi 👋 GenX lady raised by Silent Generation parents, too.\n\nMy Dad grew up without a television or modern heating/air and loved it.\n\nYou’re cold? Go put on a sweater. You’re bored? Please read a book. You don’t like this? Well. When you’re hungry enough, you will.\n\nThere’s something to be said for making do with less, being thrifty, and remembering there’s always someone out there who has it a lot worse than you do, so be grateful.\n\nYes, couple that with enlightenment and tolerance and you can get some fabulous results. ",
        "My Dad was the greatest generation, 1927, and served at the end of WWII.  He went to college on the GI bill since his parents lost everything during the Great depression.  My Mom was silent gen, 1930, and quit school in 9th grade to help her single Mom pay bills.  I was their last child, #6, and by the time they had me, they were tired.  I ran wild and had a great childhood.  They were awesome parents, just tired.  And very frugal.  Growing up in the great depression never left them.  We weren't poor but never wasted money on anything frivolous.   I had to beg for a month to get red swoosh Nikes in 8th grade.  (1981)",
        "Same. Dad was a wartime kid during the Blitz and Mom was born during the Depression. My husband, who’s a Boomer, had parents who were also Silent Gen wartime people (mom an immigrant during Occupation, dad a GI), and this is one of many reasons why we get along.",
        "I feel the same about my kids. It's kind of awesome❤️",
        "My dad was born in 29, mom in 35, and they had me in 76. I was one of very few kids with \"old\" parents, but I was the one with the fewest rules. I never got grounded as punishment and never had a curfew. My dad was raised by a real battle ax in his mother, so he wasn't super sensitive about a lot of things. We were not allowed to complain about anything our mother cooked because that's the way he was raised. My mom was more easy-going, but also pretty socially conservative. The Boomer moms let their daughters do things that my mother thought was inappropriate.",
        "GenX/Silent Gen and I love my background and upbringing.",
        "Me too, I love Gen Z",
        "Yeah you’ve just described our family too! Yes!! These kids definitely give me hope!!!!!",
        "It’s weird how bragging about your kids political leanings is a flex in this group. ",
        "Were your parents college educated?\n\nAsking because mine weren’t, and I never considered that they would [be able to] save money for me to go to college.",
        "I’m four years older than you, and basically same lol",
        "> if they saved any money up for me for college and I got laughed at. I am an only child. Like how did you screw that up.\n\nA shit ton of silent gen parents did the same thing.\n\nhow did they screw it up?  It was the 70s/80s\n\n Father divorces mom,  spends all the money chasing skanks, remarries multiple times, spends whatever is left on overpriced vacations and cheesy cars.",
        "I was born in ‘68 to 2 Silents who divorced in ‘77. Dad was a professional musician, Mom worked long nights in a factory, neither one were hardly ever home before or after the divorce. Even before they divorced, they seemed to be having some kind of weird competition to see who could sleep around the most in our town of 200 people. College was a word that was never even mentioned to me; I grew up knowing that my job in life was to marry as well as I could. My older (by 6 years) brother taught me everything that I knew until I was grown: how to ride a bike, how to catch a softball, how to cook, how to drive, who Led Zeppelin was, etc. I was raised by my brother, the TV, and lots of books.",
        ">asking my parents if they saved any money up for me for college\n\nWas that really an expectation? I didn't even think about college as I didn't have a plan and didn't want to go and be spending a grip without a one.",
        "College? Three of my mom’s siblings didn’t even finish high school.",
        "'73 here, only child and had the same experience.",
        "I don’t think they expected for college to be as expensive as it became. Thankfully I’m close to the PSLF, otherwise I would probably be paying my student loans off until the day I die.",
        "OMG, are we related? 🤣",
        "I was born in 72 and going to therapy now for the downright neglect.",
        "I was born earlier in the 70s to two boomer parents. They were both first generation to go to college in their respective families. Almost no college savings for me (they had enough for my first year) and no plan for helping me pay. They asked if I applied for any scholarships a month before my last day my senior year, having never broached the question before. They somehow thought the school counselors would magically tell me where to get a scholarship! My mom’s college was paid by her parents (who didn’t save, but were still working and easily paid as they went). My dad was in ROTC and went to officer’s school then the army during the last of Vietnam, so his school was paid by Uncle Sam. They thought I could pay for all of my college expenses with a part time campus job! In the early 90s you could definitely pay for room and board and some gas that way, but not tuition also. I ended up in a donut hole where my parents made too much for me to get a federal loan, but was too young to sign for the loan by myself. I had to take a few years off and work to save up and then go back signing my own loans.",
        "Same. 5 years older, saw the big picture about 4-5years old. Didn't even bother asking. Busted my ass, received scholarship all by myself,. Guess who tried to take credit for it, instead of \"I'm so proud\"",
        "Yes! I am in the same boat.",
        "Dude that is my story too. Took the city bus to kindergarten. 4 incomes between them and my step parents. No college money. Born Mid 70’s though. ",
        "You and I had the SAME upbringing..",
        "You and I have the same year and story.  Only I knew better than to ask for college money, I was doing that alone also.  They were broke and barely surviving themselves.  Fortunately, there was a good community college system near me that had night and weekend classes.  Took me 7 years to finish the A. S.",
        "my parents didn't save at all, and couldn't save, and there was zero expectation that any of us would go to college because up until then, no-one else in my family had gone to colleged.  Most had dropped out of high school or barely finished, so the thought of college was pretty far from the minds of my parents who were struggling to keep food on the table.",
        "My boomer parents did have a bit of college savings for me. When I was in high school, my dad used it to go to law school and switch careers from public sector to private sector.\n\nIf I recall correctly, I had a bit of savings as a kid, too. My dad raided that for a motorcycle.\n\nBut no hard feelings. Just because it was earmarked for me doesn't mean it was mine. I didn't earn it, and circumstances change. I did still get a good deal on college -- \"You can have tuition & books, or dorm & meal plan. Your choice.\" I took the tuition checks, and lived at home so he still paid for it all.\n\nBut back to the original topic, my sister and I are both Gen X eight years apart. We were both latchkeys and independent, but not necessarily neglected. She got more attention overall, as the 'rents were more mature the second time around. We are practical examples of \"2 kinds of Gen X.\"",
        "Ok but you get the point of OP's post right?  Try and remember your  friends who's parents were old at at the time.\n\nYour friends got away with different shit than you did.  They were probably early access to booze, or transportation, or maybe music or info that their older siblings gave to them.  Those parents.  The silent generation who mixed with boomers.  Older Gen X kids were raised differently than younger Gen X kids.  Smoking is the most obvious example.\n\nCable TV and VCR's for parenting is how I like to mark it.",
        "Oh well, #amirite",
        "I was born in 1979 with boomer parents. They both went to college in the 60's , paid for by their parents (they said). As another comment mentioned they got divorced and spent on various other things over the years so when I went to college, it was scholarships, grants and loans. I started college in 97 and it was way easier back then to cover the costs that way.",
        "I laughed at the mere idea of asking my parents if they had a college fund for me. I'm not sure that I even had a friend with a college fund. Think I was an adult before I'd ever heard of such a thing.",
        "Yes",
        "Preach",
        "Yup I had silent Gen parents.  Traditional & conservative.  We were expected to go university, which my 2 older boomer brothers did.  I was the youngest & the only one in my family who went to college.",
        "Hey there, same setup. My sibling gap is only five and seven years but they are noticeably different people to me.",
        "Same. Siblings much older than me. My parents were tired by the time I came along. \n\nWonderful and I love them, but they definitely were not overly engaged in parenting. One of my oldest siblings commented to me about the rules growing up. I didn't know what the heck she was talking about. That cemented to me that we were raised in two very different households!\n\nI am pretty easy going. \nSiblings are more anal and more stressed.",
        "Same.  There were 9 of us, parents both Silent Gen - divorced dad had 4 kids, divorced mom had 2 kids- they got married and had 3 more.   The first 6 kids are steps to each other and they are all typical Boomers.  They all say and do things that make me go hmmmm….,,The last 3 kids (of which I am the middle kid) are all typical Gen X.  \n\nActually now that I think about it.  I’m also a typical middle kid 🤔.  Yikes.",
        "Same here.  Parents pretty much let me go feral as long as I didn't cause trouble.",
        "This is me to a T.",
        "Exact same here. Next sibling nine years older than me.",
        "My husband who is a millennial doesn’t understand that Saturdays as a child from 4 was cleaning the kitchen living room and bathrooms while my brothers and father went looking at cars.",
        "similar situation here, but in my case I think a lot of it was he was a boy, the oldest boy.. I've seen how boys are treated in my family... (like gods)  I prefer knowing how to use tools and how to mow the lawn to anything tbh.",
        "Gen Jones leaning Gen X here (1961 born). Silent Generation parents (1934,1937 born), latchkey and VERY feral in the 70's, on my own adventures constantly. I'm the oldest of 3.",
        "This sounds spot on",
        "Yep, that first paragraph is me for sure. 8 years between me and my older siblings. Doh! I basically watched my older siblings put my parents through the wringer and by the time I was old enough, I pretty much had to figure it out on my own once I turned 15 or so. My parents were great but we were broke.",
        "I am both. I tend to shut down into silence whenever I'm anxious, but get me talking in a happy mood and it's a different story!",
        "True, but sometimes fun to boil down and talk about. We all had common world events that happened to us while we were all about the same age so for me it’s about nostalgia, which I love. I know some on here aren’t into it though",
        "You sound like GenX to me 🤘",
        "You described me, except I'm male.",
        "Lol, that’s great !!!",
        "My grandmother lived 1910  - 2010. She saw so much, lived a quite life surrounded by family as the world drastically changed around her. Her hardships were serious",
        "You seem a lot like me except my mother was Silent Gen. She had anxiety and depression and was an alcoholic. So I think there’s more in play here than just having Silent Gen or Boomer parents.",
        "Yes, but there are shared life events that happen to a group of people that are around the same age that makes us a cohort. Growing up in the 70s with no internet or even cable tv is a shared experience different than growing up now with social media. Sometimes it’s just fun to generalize",
        "Exactly same here",
        "people have a *really* hard time with that\n\nlol",
        "Younger GenX chiming in - in my experience, Millennials and most GenZ’s have def been more coddled than we were. But let’s be real: living independently at age 18 (or hell even at 28) isn’t anywhere near as attainable as it was when we were that age. I could cite numerous economic statistics that will back me up but it’s bedtime for this middle-aged mama 👌🏼",
        "It was like a tv show, for me, especially since my friends family was perfect. 2 parents, a daughter and son, and they were well off as well.\nOnly had a few  friends that had both parents. The rest were feral latch key kids (like myself ).",
        "I was going to say this. My siblings and I were born 68, 71 and 73 and we had boomer parents. My youngest brother way more aligns with the later group even though he was the same as my older brother and I growing up but his high school time and early adulthood was so much different. He was in high school for my last two years but it was the two years after I left that the 80’s morphed into the grunge or hip hop world of the 90’s. There are a lot of later Gen X here that I don’t relate to as much because I was done college by the time they hit high school and pop culture was the last thing on my mind. I didn’t watch TV much in the early 90’s. I took typing. My brother took keyboarding. 🧐😜",
        "I totally did not think of it that way!  That totally explains how the older GenX are unlike younger GenX, but yet there is such a huge overlap among the full range of GenX I know.  Also, it's turtles all the way down, in that it's not just parents, but what generation were the parents of your parents?  I had grandparents from 1900's and parents from the 1930s, but some of my peers had parents and grandparents who were much much younger.  I really feel like the way I was raised was defined much more by my grandparents than my parents, but some GenX parents really rejected their parents, etc.",
        "Raised by Boomer- Gen X, raised a Millennial who’s raising Gen Apha. I’m way off your generational time line. lol",
        "In my experience this is spot on",
        "Same for me and my sibling,",
        "My older brother 68 is the same. My younger brother 73 is also like you. I’m in between, 71. Oldest will do no wrong. I do plenty wrong but don’t get caught, youngest gives no F’s and rocks every boat. Lol",
        "Upvote for the Blues Brothers",
        "I really felt the rope me back in and take the heat off dad part. It helps just a little to know that it's not your imagination. It happened to others too.",
        "I agree. My brother and sister are both Boomers. ('51 & '53) Being born in '66, raised by two Silent Generation parents who grew up during the Great Depression *and* the dustbowl in Oklahoma gives for a slightly different outlook and attitude than my contemporaries.  Just one example, I wasn't actually a latchkey kid cuz my mom was always home, but I was treated like one. Except for the fact that I wasn't trusted to have a key till I was in high school.  (Other issues.)",
        "Same here",
        "READY FOR QUICKSAND ☠️",
        "🖐🏼",
        "I’m way diff than my sister and shes 82 and im 78",
        "I just assumed boomers were more involved. Probably because I was raised by a television and that’s what was portrayed",
        "I had a single mom, dad died when I was one and also had a disabled sibling, older than me. There just wasn’t the resources, time, money, emotional stability to be raised any other way. I’m pretty laid back and independent, like a house cat. My wife  is an only child with 2 parents and she’s more like a dog. I’m not sure how it works but it does",
        "I was latchkey with a silent gen mom. I think it was before latchkey was actually even a thing. We pretty much just took care of ourselves while mom held down three jobs.",
        "I don't recall hearing about razor blades in apples until I was old enough to start remembering trick or treating as a small kid. I was born in 69 and a true GenXer. Seemed like the booby trapped apples and laced candy didn't really start until the early 70's. My parents never talked about that kind of stuff when they were growing up. Not saying it didn't happen but just never heard of it. My parents were the silent generation and not Boomers. Both born in the early 40's.",
        "Same.",
        "Oh I never wore jeans in high school either! I really tried to rock the romantic hippie mixed with Espirit preppie. I’m a little older than you (I was in my 1st semester of college when Nirvana’s Nevermind was released) but I get the rebelling against my peers.",
        "Yup, and Maximum Overdrive!",
        "> Boomer parents are who came up with all that “everyone gets a trophy” \n\nlol, not my type of boomer parent",
        "No, never assumed that. Just wondering what others thought or if others had insight. Chill",
        "You’re doing a great job",
        "I think as a generalization/stereotype this is true.  I was raised by silent gen parents and so they didn’t pass down (again, in a generalized way) boomer mentality to me",
        "Just asking if there are shared experiences or different takes. Thanks for adding to the convo. You sound very interesting",
        "Born in 65 and I’m not at all like my older boomers brothers.  I just can’t relate to them.  I also have a boomer hubby.",
        "This isn't the case and I am proof of that. I have not once voted for the orange asshat. Parents born in '52 and '55...so come again?",
        "I’m not a MAGA Psycho Republican & I’m GenX. I know 1000’s of our generation thrilled about Harris running against the Orange Man.",
        "Yup my parents were the same way",
        "Junior boomer! I like that term",
        "I started as a brain; life made me a basket case.",
        "Team Basket Case.",
        "\"Won't you come see about me? I'll be alone, dancing, you know it, baby.\"",
        "Lol! If only our full range could actually be captured in a movie...  \n\n\nRealistically I think we could even entertain everyone in every media category.",
        "You know, despite how many times I’ve watched it, I just now realized that I didn’t identify with any of the characters. Huh. Maybe the janitor.",
        "🤗",
        "I'm a bitch, I'm a lover",
        "Team Brainy Basket Case. 🙌🏻",
        "![gif](giphy|xThtar0e9kO3WkwQ1O)",
        "I thought we weren't seen at all 🫣",
        "Bravo",
        "https://preview.redd.it/v4ih809i9khd1.jpeg?width=4000&format=pjpg&auto=webp&s=9f226754a4e2ad1a0773f25cab193dd39450a97b\n\nMy favorite office print",
        "Exactly it’s less about the outcomes (personalities) and more about the influences (pop culture, current events, politics) and when those influences reached the GenXers. People who grew up in rural areas or isolated homes didn’t experience the 80s or 90s when or how someone else did.",
        "No they meant a monocle",
        "I think monotone fits, we’re not just one note, we’re an effing symphony!",
        "![gif](giphy|xT5LMPqrh7mcpYCdGM)",
        "Either way man ",
        "Yeah you could even go by minutes, hours, even days, yet someone more clearly agreed by most as outside of said generation will seem to fit right with them by shared experiences or otherwise. ",
        "Except boomers and millennials \n\n/s",
        "Same! It’s a very odd but not unusual combination amongst narcissists.",
        "Me too!  Such weirdness.  Raised Catholic which added to the weirdness because there was an additional sexual repression...\n\nOh and Mom is Silent gen\n\nSigh.",
        "Same. Exactly.",
        "I never really thought about it, but this is exactly how I was raised. Baffling is the perfect description.",
        "Same.   The last kid...",
        "Wow, this puts into words what I have always struggled to articulate. My parents were Boomers, but I was also raised with a baffling combination of hands-off and micromanagement.",
        "Same, but throw in a dash of greatest gen with the silent one and only a double dose of Boomer X siblings.",
        "My dad was a Silent on the cusp (born in January of ‘41) while my mom is an early Boomer (born in November of ‘46).  He was incredibly laid back and parented as such while her style was exactly as you described.  In fairness to my mom, my dad died when I was fifteen and she was devastated and overwhelmed.  But even before that it was tough to gauge how she’d react to something.",
        "Oh, no, my parents were wonderful.",
        "Also gen X raised by silent gen parents here. \n\nAlthough honestly the tv/heating/air thing isn’t a great metric outside the US. \n\nMy mum grew up in a house without electricity and I grew up without tv/heating/air, as did my millennial kiddo, and my zoomer kids are also growing up without the heating/air part as well. \n\nBut yeah there is a definite mindset that comes with having silent gen parents that a lot of Xers have and personally I think it is a good one.",
        "My family as well and I heard a lot of those sayings growing up. So does my kid :-) \n\nWhen both my parents were little they had to use an outhouse, got through WWII rationing (I still have one of my granny's books) and my grandparents all kept large vegetable gardens until at least the late 70s. When I complained I heard ALL the stories about those days. And it actually WAS uphill to school both ways because they had to walk over a mountain. They took me there to prove it.",
        "sounds like my parents.",
        "I don't believe it's just generations but income. My mother is a Boomer born in 1952, But she was raised in rural Arkansas. Plus the fact that she was a single mother of 3 boys for most of my life.",
        "Greatest Generation parents, also. My mom was a teen during WWII, born 1928. My dad, four years older served briefly in the Army-Air Force as it was known then. The Air Force was not a separate entity yet. I feel like I benefited from their frugal upbringing necessitated by the war. I loved my childhood. They pinched pennies, but so did my friends’ parents. I was born in 1965, but a number of kids I knew had parents of the same age as mine.",
        "It's weird how being a bigot is political.  Instead of being \"my political stance\" I think racism, homophobia, etc, should be \"being a shitty human.\"\n\nI'm not bragging about my children's political stance.  I'm excited that they're empathetic, caring humans that are tolerant of others.  And before you spew some shit about \"but then they need to tolerate racists\" you should learn about the paradox of intolerance so that we can avoid that discussion.",
        "My father went to electrical school in Boston for 2 years and ended up becoming a pipe fitter in the city, mom didn't have any formal education other than word processing lol.",
        "My father put himself through college, first of his family to do so. Through BS and the MBA. Mom went to college with help from Dad and adult women's program 17 years later. Before college was was farm boy and Marine. Both parents Silent Generation.",
        "Same here. It never even crossed my mind that they would pay for college. College wasn’t even really discussed. I did end up putting myself through college for 2 years and then trade school after that.",
        "Or, remarries and has kids with the second wife.\n\nGives those kids (who were born 10-15 years after the kid(s) from the first marriage) cars and pays toward college and rent for them well into their 20’s, but didn’t give kid(s) from first marriage a dime toward college or any costs of living after making that last child support payment before the kid(s) turn(s) 18.",
        "Excuse me. My father feels personally attacked by this content.",
        "Mom was the one who got with all the assholes, moved me all over the country chasing dudes and they both drank my college money away...haha but yeah, we all have the same screwed up story somehow.",
        "You're truly luck to have such an awesome brother. ",
        "It was for me, they didn't care, my father was a union pipefitter and mom was a secretary. Everyone else in my family however wanted me to get an education, everyone except my actual parents lol.",
        "I know it wasn't for me. Nobody in my family went to college, except for my grandmother's half brother than I met twice, I think. My dad and my brother barely graduated high school. I grew up in a rural are full of people who worked in one of the manufacturing plants, oilfield, or farms. I worked with my dad in the oilfield, and that's what made me think there was a better way. After I scored well on the ACT my junior year, I started thinking seriously about it, but there was no college fund.",
        "They did not.. nor did they pay 500K for their house. Neither of my parents finjished college and both worked in the same job for 20+ years. Hell one of them has a pension.",
        "Every kid is raised different. Based on economics, race, culture, religion, location, etc",
        "I was 14 drinking in bars in NYC. The older kids weren't any different than me. I ran with the older kids because we were the same. Nobody gave a shit. I parented myself and have the PTSD to prove it, unfortunately.  So no, I guess I'm not quite getting OP's point.",
        "Yeah I smoked for 25 years, I also used to steal my dad's Parliment's lol.",
        "i  was born to a boomer and a silent gen. neither were old at the time. i also got away with a lot. oh, i am core x.",
        "Let's try 25 years, 23, 20, and 13 years older than me.",
        "Yep. Exactly this. I was left to do what I wanted mostly. I listen to the stories my siblings tell and think, nope, had none of that.",
        "I’m the oldest child and oldest grandchild. My parents dropped me off at my grandparents in June and picked me up in August. I started babysitting my brother and cousins at 8. My grandfather was retired and “around” but I was feeding and dressing kids. Not all boomers were absent but yeah I felt it when I tried to get my mom to watch my kids for a week and “she didn’t have time”",
        "Awesome. I remember us as very cool people. Hated authority. Hated our parents. Wanted to change the world. I don’t know what happened.",
        "Wow , ww1,  Great Depression, ww2,  that is a lifetime of experience on its own then another 60 years , I bet she had quite the perspective, I hope she shared with you her wisdom.",
        "Exactly - my mom was silent gen but I was influenced a lot by my greatest gen grandfather \n\nI learned that GenZ is more apt to appreciate working hard and have traditional values - I think that’s true. They also picked up some financial frugality, they carry less student loan debt (at least the last time I looked they did)",
        "Yeah, one of my kids is 33 and i expect you're closer to his age than mine :)",
        "Ha!  That’s cool and interesting, thanks for sharing.",
        "I had a similar experience.  My mom was a SAHM, but my parents kept that door locked and I wasn't given a key until I graduated HS.",
        "I (‘78) remember hating the sound of the “60 Minutes” clock that heralded some new doom-and-gloom story that my paranoid BPD mother would watch, believe totally, and let me out of the house even less. Everyone was a rapist and predator. If I wore shorts to school or across the street to the mailbox, they would all flock. /s but she believed it.",
        "I was born in 66 and it was a thing we had to lay out all the candy and stuff we got on the dining room table while my mother examined everything.  We really only went to houses that we knew anyway.  I’m in nyc",
        "Heh, same age exactly actually! I was artsy fartsy hippie. Long hair, long black skirt stolen from the artsy goths, tie dye, badly hand painted flowers on things.",
        "Yeah, not every boomer parent?  But they were definitely running the show as a generation when that started",
        "Thanks. It doesn't feel like it, but I'm trying hard. Parenting is probably the only thing I've ever really tried hard to be good at. He's fun though, he's a weird kid who loves 80s and 90s stuff, and knows the words to just about every Pearl Jam song ever written.",
        "![gif](giphy|3o6MbisQwZAh4Lqesw|downsized)",
        "So say we all.",
        "🙋🏼‍♀️",
        " 🥇🥇🥇",
        "Brainy basket case princess here..",
        "Team basket case too🇺🇲👍🇺🇲",
        "Dandruff is delicious.",
        "☺️♥️",
        "It did a pretty good job.",
        "Sup sis 🤙🏼🥴😂😂",
        "I grew up in a small Kansas town, and a lot of the US felt mythical to me. My only exposure to a big city was in the movies.  I thought latchkey kids had to live in a high rise and be afraid of violent older kids in the neighborhood.  I literally didn't realize _I_ was a latchkey kid until years later. In part because I didn't lock myself in the house. I played in the yard or the park next door.\n\nBut I did watch MTV. I remember when it first aired. I grew up on Star Wars. There are a lot of things we share, but a lot of individual experiences we don't.",
        "Pardon me, do you have any grey poupon?",
        "No they meant monotremes. We are surely not all platypuses.",
        "I’ve always wanted to wear a monocle but I just don’t have the eyesocket dexterity. Sigh.",
        "Oh, I had that in the 80s. I was sick for a week.",
        "We might be the last generation to know what a monocle is. 🧐",
        "Well, sir, there’s nothing on earth\nLike a genuine, bona fide\nElectrified, six-car monorail\nWhat’d I say?\nMonorail\nWhat’s it called?\nMonorail\nThat’s right! Monorail",
        "Marsupial?",
        "🧐🧐🤣🤣🤣",
        "I'm a perfect example. I'm an early millennial who 100% identifies more with gen x. The internet and cell phones didn't become rampant until I was in my late teens. But according to most sources, I'm a millennial, even though I'm right on the line.",
        "You just invented astrology. Precision to 3 minutes, accuracy debatable.",
        "Oh yeah, we were also Catholic. I'm still unraveling all the weird shame about having a female human body that was seared into my brain.",
        "Oh LOL. Must be nice. 😕",
        "If you don’t mind saying, what part of the world do you (and your millennial kids) live in, and/or what’s the climate like there?",
        "Wow, Dad used an outhouse, too.\n\nBoth my parents were older than everyone else’s when I was little, except my best friend, who was adopted after her Dad married his second wife. She was over 40 and had never had children, but always wanted them.\n\nGrandfather had a huge, glorious garden, too.\n\nI can still see his okra, red potatoes, squash and tomatoes in their wood harvesting baskets.\n\nIf the weather permitted, rows of those little dark red strawberries, on those mounds wrapped in heavy, black plastic.\n\nI would love to taste those flavors now.\n\nIf I want anything even close, I have to pay a fortune for organic, and it still doesn’t approximate. ",
        "Lol my husband was born in 69 and grew up with a shared toilet at the bottom of the tenement",
        "I always had the oldest parents.   Mom was 37 and Dad was 40 when I was born in 1967.  I kinda lucked out because by the time I came around they were better off financially.   Always took one big trip every summer.  In 5th grade they pulled me out of school for a month and off to California we went in the motor home.  I miss them and always will.  Dad has been gone since 2009 and Mom since 2018.",
        "Sounds very much like my parents, only my dad leaned HVAC in trade school and started his own commercial HVAC business. He actively tried to prevent me from going to college unless it was Liberty University because he didn’t want me to get brainwashed. 🙄 \n\nHe did save money for my wedding, which I would have much rather spent on college. I got a degree (not from Liberty) and eventually went on to get a Master’s degree, which I’m still paying for at age 48. \n\nMy mom had a high school education but learned accounting and bookkeeping to help my dad start his business until he could hire someone to take care of the books.",
        "Oh my god. You just described my life \n\n\nAll of my siblings (8, yes eight) are millennials and the parents paid for college, bought them cars, let them live at home forever (one is still there at age 42 with a wife and 2 kids also living there) and gave them anything and everything. \n\nMeanwhile, my genX ass got nothing.",
        "I had the same thing and I thought I was the only one!  I received basically no financial help. The siblings from the remarriage received financial help with cars, post secondary, extra cash at Christmas etc etc. I did ok but their lives were better in that they received a university education while I got by with certificate programs which I attended while still working. This makes a big difference in finances.  I’ve always been lower income while they have lived lives that involve overseas travel, opportunity for good savings while I don’t even have a passport. I don’t hold out much hope for any kind of inheritance. I was resentful for a long time but have let it go. Now the upside is that I’m very self sufficient and resilient, have made progress with extreme frugality and I am at peace and love my life. So like anything there is good and bad to a situation. You learn early that life can be very unfair.",
        "Your college money? So you earned it and they stole it ?",
        "I was very blessed and much loved; I didn’t miss a thing because of our crappy parents. He died in 2009, and I still miss him every day. 🥹",
        "My parents didn’t go to college and didn’t/couldn’t save college money for us. We all got through with loans, and whatever support they could provide while we went. Back then, it was totally possible to take loans and work your way through.",
        "My Father went, but my mother didn't. I had 5 brothers, and they all went right after HS. One didn't finish and I don't know how much he was on the hook for and the others also finished and were on the hook for ???, but I know they all had loans. \n\nI went in the service for a for years and went to a trade school afterwards and dealt with all the paperwork myself. I really got no help from the parents.",
        "You have some old Gen X in you.  Going to bars at 14, you ran with older kids.  Impressive, actually.  My 1980 brother is much more of a millennial.  More prone to run a mobile liquor store out of a hoopty with a fake ID.\n\nThe born in 1967 Gen X is a very different perspective than a 1975 or 1980 Gen X.  It's the era, not the parents.",
        "That's (checks math) considerably more than me 😳",
        "Wow, I thought my dad's family was bad. His oldest sibling was 21 years older than he was. The closest one to his age was 10 years older. He had a nephew who was only a couple of months younger than he was.",
        "My Boomer brothers are 20 and 17 years ahead of me. It's rare to meet someone in the same situation.",
        "Yeah, you’re my sister. My other sister and I had to break my parents in. My the time the youngest got there eight years later, my parents were tires, like you said, and just pretty much over it, so she got away with murder. We did not have the same parents *at all*!",
        "I was on my own my entire childhood.  My brothers play hockey and I play by myself in the bleachers. \n\nI am just used to being independent. \n\n\nThat sucks that your mom doesn’t want to watch your kids for more than 4 hours.",
        "I had a huge sticker on my first bass that said Question Authority. That was about 40 years ago and still feel the same way",
        "My son will be 33 in October. My GrandBoy is 6. I’m 54. You were completely wrong!",
        "There were a lot of stories that went around about the apples with razor blades, oranges injected with vodka, laced candy. Fruit always go tossed and the parents of us kids would sift through the candy and \"inspect\" it before letting us have it. Seems to.me that many Snickers, Milkyways, 3 Musketeer bars went missing. They didn't have the tiny ones in my day, they were always the full size bars back then. Seems we were left with the penny candy IE root beer barrels, jaw breakers, atomic fire balls and stuff like that.",
        "Same here. But a lot of the good stuff went missing. LOL",
        "Sheedy was so hot before they dizneyfied her character.",
        "🧠🧺🤜🏻🤛🏻 Just observing the world, and finding it bizarre. 😎",
        "But, of course!",
        "Grey poop on what?",
        "I actually just bought some tonight. 😁",
        "I infer from this comment that you are stating that some of us are platypi. I support this assertion.",
        "Is this the krusty krab?",
        "I have a platypus controlling me!",
        "Aussie Gen X, represent.",
        "Cause some of us are echidnas!",
        "Save Ferris",
        "It’s very contagious 😷",
        "Yeah, I quit the Church at 18, never really looked back, but sometimes I still unravel the weird sexual shame I was left with.",
        "That’s a really good question.  I could easily live without AC, but not heat.  I live in Wyoming and you need at least two methods of heating the house in case one fails because you’ll definitely die without heat in winter.  I’m grateful for the AC in summer though.",
        "Damn, you brought back some memories for me. My grandparents up in Maine had a large garden, and it was fun helping out when we would visit during the summer. Blueberries grew wild on their property as well, and I loved picking a bunch in the morning to go in my pancakes. Everything was so fresh and delicious and I treasure the time I spent up there.",
        "Thanks for the description of that garden. I can see it in my mind. Must have been a wonderful childhood! \n\nI'm trying to carry on the traditions, but I only have two little tomato vines, some undersized turnips and even my green beans are struggling.",
        "My mom was 35 & my dad was 42 when I was born",
        "I *thought* all during school that my parents were older than anyone else’s. Actually later learned of many classmates who had siblings that went to school with my brother, who was 15 years older. My mom was 36 and my dad 40 when I was born.",
        "I can’t decide whether this makes it better or worse, but I think that the thought of helping me with a car or college sincerely didn’t even occur to my Dad, even as he was bragging to me (while I was in college, for which he provided no assistance) about setting up a 529 college savings plan for each of them. \n\nAt least I could blame it on the kids being with the second wife, and maybe she was contributing towards them, and/or his assumption that my Mom and Step-Dad had everything covered. That happening with your Mom and Dad’s later kids just flat-out sucks.",
        "Just please tell me the parental units don’t say things like, ‘well, Iamoldandwornout never was much into school,’ or ‘(the siblings) really worked hard and applied themselves and look at what they’ve done for themselves…’",
        "I don't think people should have children if they aren't willing to do what's best for their children, isn't that the point? Don't people want their kids to do better than them? To succeed in life where they couldn't? I know if I ever had kids I would make sure that I had money saved for them, even if it was $1000 because that's all I could save, but it would still be something. The reason I never had children was because I was too afraid that I'd turn into my parents...pretty fucked. I know I'm not owed anything, but why bring me into this world if you're just setting me up to fail? My father just had a liver transplant because he spent 50 plus years sitting on a barstool. Was it my money to spend? No, he can do what he wants with it, which he did. He drank it. But again, why even have a damn kid in the first place if your just going to be a selfish ass?",
        "Yeah the entitlement is  revealing…",
        "I'm very sorry for your loss. They aren't very far away you know, I'm sure he's still looking out for you from the other side. 💗",
        "Absolutely and I agree, I could have taken out loans and went to community college like all my friends did.  The point was really I didn't have the support. My aunt and uncle invited me to stay with them in NJ while I went to college. My dad's brother is only 2 years younger than my father, both of my cousins were college educated and have done very well for themselves, but they also had supportive parents. My uncle and aunt are boomers too but my cousins are 10 and 5 years younger than me respectively. Like oil and water my father and his brother. Truly.",
        "I agree with you. I just wanted to add this to maybe give some hope to young people trying to go to college: it is still possible. All three of my kids worked their way through college (Two at UTenn and one at Miss State.) Summers at the movie theater, jobs after school, etc. All three graduated with student loans of around $4000 each that I paid as their graduation presents. It can be done. It’s not fun, and you have to hustle, but you can do it.",
        "I wanted to go into the Air Force, but my eyes were too bad to be a pilot. Being like most 17 year olds who know everything, I refused to even consider any other career in the Air Force. I ended up getting a small scholarship based on my ACT scores, so I chose that. Of course, I ended up enjoying the college lifestyle too much and blew that after my first year. \n\nOnce I went to college, my mom basically told me I could visit, but if I dropped out and came back home, I was paying rent and utilities. I basically just came back for occasional visits.",
        "I mean it could also be the fact that I was raised in Brooklyn and not Cornville, Iowa. I also believe where people were raised had a lot to do with their circumstances and locations. Would I have been the same if I lived in a rural or bedroom type of community? I can't say. NYC is a different animal then most cities, especially during the 70's and 80's. A lot of younger kids who I knew are considered millennials but are a lot like me.",
        "This right here.  I was born in 65 and I guess I'm on both sides of the fence there but times were easy. You didn't have to go to college to make a good living  If you were smart enough to pick up a trade and be good at it.\n \n This post reminds me of one of the best jokes I heard and still believe.\n\n How do you get a liberal arts major off your front porch? \n\n Pay for the pizza!!",
        "i would say older xers are more '' prone to run a mobile liquor store out of a hoopty with a fake ID '' than a xennial or millenial  ?",
        "LOL. My parents were born in 1914 and 1924.",
        "I have two nieces older than me.",
        "I remember that attitude, still have it to this day.  Thought it was an autistic trait lmao.",
        "That is awesome !!  I know I say that a lot. Lol. I feel the same way too.  All my favorite bands are still touring and seem to feel the same. Slipknot, Lamb of God, Cannibal Corps. So excited for Slayer. See I figured the jerk Gen X’s were the jocks. lol. 🤘🤘",
        "Totally. You're close to my age, your parents had you young I guess",
        "I remember that! I was barely allowed to eat sugar at all, but we had to make sure the Satanists didn’t get to the one peanut butter cup I was allowed to eat. \n\nMy mom also watched all the “rebellious teen” talk shows and clamped down on me accordingly, because so many other kids wanted to do drugs and have sex with a bucktoothed, unathletic, socially awkward peer who wasn’t allowed to watch MTV or most TV and had close to zero shared pop-culture references.",
        "Lol!!  Yeah…..",
        "Would ja please pass the jelly?",
        "Where's the beef!!??",
        "I mean, some are also echidnas. Like Knuckles over there.",
        "No, this is Patrick",
        "Yeah climate makes a massive difference. I’m in inland(ish) Australia where winter lows can get down to -5 C on the regular and summer highs hit 40 C + every year. Average winter lows are probably closer to -2, and average summer highs are usually in the high 30s. So pretty temperate all things considered but omg sometimes I would kill for proper ducted heating and air. Especially since Australian houses are basically glorified uninsulated tents",
        "💚✅💚",
        "I know it's not a contest by my Mum was 37 and my Dad was 50 when I was born! 50 yr old Dad was a bit hard for me. He was more like a GrandPa when I was a teen and opted out of actively parenting. Well, neither of them really had a concept of parenting so it's relative. Ha Ha. I like me, so I'm not down on them, I think they gave me some unique gifts..  but it was a bit different.",
        "Their later kids were with different spouses. \n\nDivorced before I was walking. Dad married when I was 3, Mom when I was 5. First sibling born when I was 10, 8th sibling when I was 18. Dad and stepmom had 5, mom and stepdad had 3.\n\nAnd I think you're right... each household assumed the other had it covered. \n\nBut I've always been the \"odd one out\" the weird kid (undiagnosed ADHD and mild autism) the black sheep of both families. It sucked as a kid, and it still sucks at almost 50.",
        "People had kids to keep up with the Joneses.  That’s what my late mom said. Everyone just decided to collectively pop puppies.\n\nStill happened to a degree in my circle. We tried without success. In hindsight that was a blessing.",
        "Exactly.",
        "Having children doesn’t mean you pay for everything they want. Many kids turn 18 and have a variety of paths. That could be working, education, trade school, military, etc.  when you turn 18, you’re an adult and that means working to make your life better. Would it be nice if parents could provide everything? Yes. Does it make for bad parents? No. You have plenty of opportunity if you’re in America. It’s just how much you want to work.",
        "What entitlement exactly? The last thing I am is fucking entitled. Trust me. Alas, thank you for your judgement, it is revealing.",
        "Thank you! Yes, I do believe that he is waiting for me and while I’m not about to jump in front of a bus or anything, I am eager to see him again when it’s my time.",
        ">I was paying rent and utilities.\n\nTwo days after graduating HS I was handed a car insurance bill. My parents had said If I was staying in school it would be covered but since I wasnt...here you go.\n\nIt was literally half my paycheck (In todays money it was $475 a month) I joined the Army not long after.",
        "Fair point, New York makes most people grow up fast.  And we're off track now.\n\nJust for laughs, Taxi.  Even then the dude looked old.  Christopher Lloyd was 47 when Back to the Future came out.  He's from the silent generation.  Imagine if that movie had been made in New York instead of Iowa.  California.  But Iowa, basically.",
        "Similar experience here raised in the deep south. The mother tried modeling herself after The Mary Tyler Moore show, single mom making it on her own in the big world. Unfortunately she was also an abusive alcoholic and a drug addict with a penchant for dating vets. The '70s were not fun.\n\nHelicopter parenting became a thing in the 80s which may explain some of the variation between early and late genX.",
        "LOL, I grew up in a rural area and did a lot of the same stuff. I was driving at around 13 years old because we lived a few miles out of town, and somebody had to go run those errands. There wasn't a lot to do, so we would get drunk on weekends. A lot of those rural stores didn't look twice when 14 year olds were buying cigs or booze. Worst case scenario, we got an older sibling, cousin, or friend to buy it.",
        "I would say, older, they'd run it like a party take a cut and drink half of profits over time.  Younger, sober temporary businessmen would get out of Gen X.",
        "Greatest Gen then not Silent",
        "My mom was born in ‘48. Had me @ 21. I was born in ‘70 had son @ 21. Son born ‘91 had son @ 26. \nBoomer, Gen X, Millennial, Alpha",
        "If we found a Reseese in our bag it was because they missed it. The adults sure got the sugar buzz we were looking for. When I took my daughter and my grandchildren trick or treating I would grab a candy out and eat it, all while telling them I was testing it for drugs. Lmao",
        "gasp!!",
        "Would you please pass the Polaner All-Fruit?",
        "I reference this all the time and no one knows what the hell I'm talking about.  It's nice to find my people.",
        "*clutches pearls*",
        "I used to crack up when he said that. My dad wore that one out. 😂",
        "A cookie is just a cookie…",
        "Stop it with the Millennial and Gen Z references....don't you know where you are, Patrick?\n\n🧽",
        "My dad didn’t seem old to me, but yours was a great deal older.  My mom was a real beauty, but she didn’t like people knowing her age.  I didn’t know her real age for years.",
        "What a punch to the gut!",
        "I'm not disagreeing with you and I've done well for myself. With or without my parents support, emotionally, monetarily or anything. I didn't rely on them as a child, sure didn't do it as an adult.",
        "You will, for sure. He'll probably be the first to say hello and welcome you back home. ",
        "Kind of the same thing I got. I ended up selling my crappy car after I got to college because of the cost, and didn't have one my first year. I didn't get one until my dad died after my first year, and I inherited his truck.",
        "Haha I know I just saw that on Instagram, that made me feel stupid old and I'm not even *that* old.",
        "There were helicopter parents in the 80s? Were they mennonites?",
        "Yeah I see the difference between myself and my cousins who are a few years younger than myself. They definitely got helicoptered, the good news is, despite all of the nonsense most of our parents put is through, it has hopefully made us stronger, more resilient individuals. ",
        "Aren’t they the same? They’re the generation which fought WWII and essentially saved the world, which is why Tom Brokaw named them The Greatest Generation.",
        "Gotta keep the kids safe!",
        "New York City?! Get a rope!",
        "OMFG! I remember! Hilarious!!!!",
        "I once saw a bumper sticker that said F___the grey poupon",
        "That commercial cracked me up as a kid, actually still does.",
        "…but a Newton is fruit and cake.",
        "Be fair now, there were also a few scientologists.",
        "Upon reflection, I suppose it does sound odd to refer to helicopter parenting in the '80s in light of subsequent decades. At the very least I do think it's fair to say the foundation for helicopter parenting was laid in the 80's. \n\nThe '80s brought milk cartons with photos of missing kids, \"this is your brain on drugs,\" No Child Left Behind, \"It's 10 o' clock, do you know where children are...,\" the weird republican fascination with abstinence, worries about the satanic influence of D&D and music, etc. That  growing engagement with all aspects of their children's lives was, I think, an early prototype in the evolution of the helicopter parent.",
        "Silent is from 1928 to 1946",
        "Absolutely we do.",
        "When I was a kid I always thought that all fancy people carried it with them everywhere because of that commercial."
    ]
}